ci4/app/Controllers/Artikel.php

SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 3, 3
SELECT *
FROM `kategori`
---
    public function admin_index()
    {
        $title = 'Daftar Artikel (Admin)';
        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';

        $model = new ArtikelModel();

        // Query builder dengan join kategori
        $builder = $model->table('artikel')
                         ->select('artikel.*, kategori.nama_kategori')
                         ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left');

        if (!empty($q)) {
            $builder->like('artikel.judul', $q);
        }

        if (!empty($kategori_id)) {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        // Pagination 3 per halaman
        $perPage = 3;
        $artikel = $builder->paginate($perPage);
        $pager = $model->pager;

        $kategoriModel = new KategoriModel();
        $kategori = $kategoriModel->findAll();

SELECT *
FROM `kategori`
---
    public function add()
    {
        $validation = \Config\Services::validation();

        $rules = [
            'judul'       => 'required',
            'id_kategori' => 'required|integer',
        ];

        if ($this->request->getMethod() == 'POST' && $this->validate($rules)) {
            $model = new ArtikelModel();

            $gambar = null;
            $file = $this->request->getFile('gambar');
            if ($file && $file->isValid() && !$file->hasMoved()) {
                $file->move(ROOTPATH . 'public/gambar');
                $gambar = $file->getName();
            }

            $model->insert([
                'judul'       => $this->request->getPost('judul'),
                'isi'         => $this->request->getPost('isi'),
                'slug'        => url_title($this->request->getPost('judul'), '-', true),
                'gambar'      => $gambar,
                'id_kategori' => $this->request->getPost('id_kategori'),
            ]);

            return redirect()->to('/admin/artikel');
        } else {
            $kategoriModel = new KategoriModel();
            $kategori = $kategoriModel->findAll();