ci4/app/Controllers/Post.php

INSERT INTO `artikel` (`judul`, `isi`) VALUES ('mie ayam', 'mie ayam babi')
---
public function create()
{
$model = new ArtikelModel();
$data = [
'judul' => $this->request->getVar('judul'),
'isi' => $this->request->getVar('isi'),
];
$model->insert($data);

SELECT *
FROM `artikel`
WHERE `id` = '3'
 LIMIT 1
---
public function show($id = null)
{
    $model = new ArtikelModel();
$data = $model->where('id', $id)->first();

DELETE FROM `artikel`
WHERE `id` = '22'
AND `id` IN ('22')
DELETE FROM `artikel`
WHERE `id` IN ('22')
---
public function delete($id = null)
{
$model = new ArtikelModel();
$data = $model->where('id', $id)->delete($id);
if ($data) {
$model->delete($id);